/////////////////////////////////////////////////////////////
//  از کاربر سن و جنسیت را دریافت کنید.
//در صورتی که جنسیت کاربر مونث بوده یا سن کمتر از 18 را دارد، به اون خطا نمایش داده
//و در غیر این صورت به اون مجوز ورود به پنل را نمایش دهید.

var age=+prompt("سن خود را وارد کنید:",0)
if(age<0){
    alert("سن وارد شده صحیح نمی باشد.")
} else{
    var g=prompt("جنسیت خود را با وارد کردن یکی از حروف m برای مردها و w برای خانم ها، مشخص کنید:")
    var gender=g.toUpperCase()
    if(gender==="W" || gender==="M"){
        if(gender==='W' || age<18){
            alert("خطا!!!")
        } else {
            alert('شما می توانید وارد پنل شوید.')
        }
        
    } else{
        alert('جنسیت به صورت صحیح وارد نشده است.')
    }
}




